import { isChristmas } from "../helpers";
import { IMusicData } from "../types";
import { absoluteCDN } from "../utils";

export const BG_IMAGE_MAP = {
     banner: isChristmas() ? "christmas" : "clouds",
     contact: isChristmas() ? "gifts" : "toys",
     christmas: "christmas-background"
}
// Enums
export enum OPERATORS {
     "addition" = "+",
     "subtraction" = "-",
     "multiplication" = "×",
     "division" = "÷",
}

// Constants
export const WORDS_BY_DIFFICULTY = {
     easy: ["օդ", "օձ", "սև", "աղ", "մեծ", "ծառ", "նավ", "տաք", "կով", "մեխ", "բակ", "տղա", "ամպ", "հաց", "քար", "թիվ", "ծով", "արև", "հին", "նոր", "ղեկ", "բու", "ջուր","կրիա", "տուփ", "ուղի", "շենք", "տուն", "տետր", "գդալ", "լճակ", "կրակ", "մարդ", "այգի", "լամպ", "գիրք", "ձեռք", "մայթ", "շուն", "ձուկ", "նկար", "ափսե", "դուռ", "փոքր", "թավա", "աթոռ", "կտոր", "մաշկ", "ելակ","դեղձ","տանձ"],
     medium: ["շաքար", "գնդակ", "փողոց", "կոճակ", "գլուխ", "սուրճ", "քաղցր", "բանակ", "դպրոց", "ցուրտ", "կատու", "արծիվ", "մատիտ", "լույս", "սփռոց", "աղջիկ", "տաբատ", "քաղաք", "գյուղ", "ռադիո", "պղպեղ", "սեղան", "կանաչ", "գնացք", "երեխա", "դեղին", "լեզու", "ծաղիկ", "խնձոր", "բանան", "ծիրան"],
     hard: ["սպիտակ", "մեքենա", "սնունդ", "գլխարկ","ձեռնոց", "բանալի", "ծածկոց", "առյուծ", "հարևան", "կարմիր", "կայծակ", "խոզուկ", "կապույտ", "հրաբուխ", "խոզանակ", "հագուստ", "ճոճանակ", "հեռախոս", "տրամվայ", "վերարկու", "ինքնաթիռ", "պայուսակ", "գործարան", "պատուհան", "ավտոբուս", "վարագույր", "երկնագույն", "վարդագույն", "նարնջագույն", "շագանակագույն", "մանուշակագույն"],
     default: ["վերարկու","մեծ","ջուր","օդ","օձ","ծառ","ինքնաթիռ","շաքար","կապույտ","պայուսակ","նավ","կրիա","գնդակ","հրաբուխ","փողոց","սպիտակ","կոճակ","գլուխ","սուրճ","տուփ","տաք","կով","ուղի","շենք","տուն","խոզանակ","մեքենա","մեխ","սնունդ","վարագույր","տետր","գդալ","քաղցր","բանակ","դպրոց","լճակ","ցուրտ","կրակ","կատու","գլխարկ","մարդ","ձեռնոց","բակ","այգի","արծիվ","լամպ","մատիտ","գիրք","բանալի","լույս","ձեռք","ծածկոց","սփռոց","սև","տղա","աղջիկ","ամպ","հաց","տաբատ","մայթ","շուն","ձուկ","քար","նկար","թիվ","քաղաք","գյուղ","գործարան","ափսե","դուռ","ռադիո","հագուստ","փոքր","աղ","պղպեղ","թավա","առյուծ","ծով","աթոռ","սեղան","արև","կտոր","հին","նոր","հարևան","պատուհան","կանաչ","ավտոբուս","գնացք","երեխա","մաշկ","դեղին","ղեկ","լեզու","կարմիր","ծաղիկ","ելակ","խնձոր","բանան","ճոճանակ","հեռախոս","կայծակ","բու","խոզուկ","տրամվայ","շագանակագույն","մանուշակագույն","նարնջագույն","երկնագույն","վարդագույն","ծիրան","դեղձ","տանձ"]
}
export const MATH_OPTIONS: [string, string, string] = [
     "bg-[#A52431] hover:text-[#A52431]",
     "bg-[#604080] hover:text-[#604080]",
     "bg-[#166528] hover:text-[#166528]",
]
export const AUDIO = {
     correct: absoluteCDN("sounds","/correct.mp3"),
     wrong: absoluteCDN("sounds","/wrong.mp3"),
     sparkle: absoluteCDN("sounds","/winner.mp3"),
     tick: absoluteCDN("sounds","/tick.mp3"),
     start: absoluteCDN("sounds","/start.mp3"),
     bubblePop: absoluteCDN("sounds","/bubbles.mp3")
}
export const CHRISTMAS_MUSIC: IMusicData[] = [
     {title: "12 Days Of Christmas", artist: "Jingle Punks"},
     {title: "Christmas Village", artist: "Aaron Kenny"},
     {title: "Deck The Halls", artist: "Jingle Punks"},
     {title: "Jingle Bells", artist: "Jingle Punks"},
     {title: "O Christmas Tree", artist: "Jingle Punks"},
     {title: "We Wish You a Merry Christmas", artist: "Jingle Punks"}
]