import { isChristmas } from "../helpers";
import { BgImageVariant, IGameTitles } from "../types";
import { absoluteCDN } from "../utils";

export const BG_IMAGE_MAP: Record<BgImageVariant, string> = {
     banner: isChristmas() ? "christmas" : "clouds",
     contact: isChristmas() ? "gifts" : "toys"
}
// Enums
export enum OPERATORS {
     "Գումարում" = "+",
     "Հանում" = "-",
     "Բազմապատկում" = "×",
     "Բաժանում" = "÷",
}
export enum MESSAGE_CLASSNAMES {
     correct = "bg-rainbow-green/95 text-black",
     wrong = "bg-destructive/95 text-white"
}
export enum Message {
     Correct = "Ճիշտ է",
     Wrong = "Սխալ է"
}

// Constants
export const GAME_TITLES: IGameTitles = {
     puzzles: {
          circle: "Շրջան",
          diamond: "Շեղանկյուն",
          heart: "Սիրտ",
          hexagon: "Վեցանկյուն",
          oval: "Օվալ (Ձվաձև)",
          parallelogram: "Զուգահեռագիծ",
          pentagon: "Հնգանկյուն",
          rectangle: "Ուղղանկյուն",
          square: "Քառակուսի",
          star: "Աստղ",
          trapezoid: "Սեղան",
          triangle: "Եռանկյուն"
     },
     pairs: {
          birds: "Թռչուններ",
          domesticAnimals: "Ընտանի Կենդանիներ",
          wildAnimals: "Վայրի Կենդանիներ",
          fruit: "Մրգեր",
          vegetables: "Բանջարեղեն",
          colors: "Գույներ",
          transportation: "Տրանսպորտային միջոցներ",
          insects: "Միջատներ",
          forestAnimals: "Անտառային Կենդանիներ",
          solarSystem: "Արեգակնային համակարգ"
     },
     christmas: {
          bell: "Զանգակներ",
          "christmas-tree": "Տոնածառ",
          gift: "Նվեր",
          ornament: "Զարդարանք",
          reindeer: "Եղջերու",
          santa: "Ձմեռ պապիկ",
          sleigh: "Սահնակ",
          snowman: "Ձնեմարդ",
          stocking: "Գուլպա"
     }
}
export const WORDS_BY_DIFFICULTY = {
     easy: ["օդ", "օձ", "սև", "աղ", "մեծ", "ծառ", "նավ", "տաք", "կով", "մեխ", "բակ", "տղա", "ամպ", "հաց", "քար", "թիվ", "ծով", "արև", "հին", "նոր", "ղեկ", "բու", "ջուր","կրիա", "տուփ", "ուղի", "շենք", "տուն", "տետր", "գդալ", "լճակ", "կրակ", "մարդ", "այգի", "լամպ", "գիրք", "ձեռք", "մայթ", "շուն", "ձուկ", "նկար", "ափսե", "դուռ", "փոքր", "թավա", "աթոռ", "կտոր", "մաշկ", "ելակ","դեղձ","տանձ"],
     medium: ["շաքար", "գնդակ", "փողոց", "կոճակ", "գլուխ", "սուրճ", "քաղցր", "բանակ", "դպրոց", "ցուրտ", "կատու", "արծիվ", "մատիտ", "լույս", "սփռոց", "աղջիկ", "տաբատ", "քաղաք", "գյուղ", "ռադիո", "պղպեղ", "սեղան", "կանաչ", "գնացք", "երեխա", "դեղին", "լեզու", "ծաղիկ", "խնձոր", "բանան", "ծիրան"],
     hard: ["սպիտակ", "մեքենա", "սնունդ", "գլխարկ","ձեռնոց", "բանալի", "ծածկոց", "առյուծ", "հարևան", "կարմիր", "կայծակ", "խոզուկ", "կապույտ", "հրաբուխ", "խոզանակ", "հագուստ", "ճոճանակ", "հեռախոս", "տրամվայ", "վերարկու", "ինքնաթիռ", "պայուսակ", "գործարան", "պատուհան", "ավտոբուս", "վարագույր", "երկնագույն", "վարդագույն", "նարնջագույն", "շագանակագույն", "մանուշակագույն"],
     default: ["վերարկու","մեծ","ջուր","օդ","օձ","ծառ","ինքնաթիռ","շաքար","կապույտ","պայուսակ","նավ","կրիա","գնդակ","հրաբուխ","փողոց","սպիտակ","կոճակ","գլուխ","սուրճ","տուփ","տաք","կով","ուղի","շենք","տուն","խոզանակ","մեքենա","մեխ","սնունդ","վարագույր","տետր","գդալ","քաղցր","բանակ","դպրոց","լճակ","ցուրտ","կրակ","կատու","գլխարկ","մարդ","ձեռնոց","բակ","այգի","արծիվ","լամպ","մատիտ","գիրք","բանալի","լույս","ձեռք","ծածկոց","սփռոց","սև","տղա","աղջիկ","ամպ","հաց","տաբատ","մայթ","շուն","ձուկ","քար","նկար","թիվ","քաղաք","գյուղ","գործարան","ափսե","դուռ","ռադիո","հագուստ","փոքր","աղ","պղպեղ","թավա","առյուծ","ծով","աթոռ","սեղան","արև","կտոր","հին","նոր","հարևան","պատուհան","կանաչ","ավտոբուս","գնացք","երեխա","մաշկ","դեղին","ղեկ","լեզու","կարմիր","ծաղիկ","ելակ","խնձոր","բանան","ճոճանակ","հեռախոս","կայծակ","բու","խոզուկ","տրամվայ","շագանակագույն","մանուշակագույն","նարնջագույն","երկնագույն","վարդագույն","ծիրան","դեղձ","տանձ"]
}
export const MATH_OPTIONS: [string, string, string] = [
     "bg-[#A52431] hover:text-[#A52431]",
     "bg-[#604080] hover:text-[#604080]",
     "bg-[#166528] hover:text-[#166528]",
]
export const AUDIO = {
     correct: absoluteCDN("sounds","/correct.mp3"),
     wrong: absoluteCDN("sounds","/wrong.mp3"),
     sparkle: absoluteCDN("sounds","/winner.mp3"),
     tick: absoluteCDN("sounds","/tick.mp3"),
     start: absoluteCDN("sounds","/start.mp3"),
     bubblePop: absoluteCDN("sounds","/bubbles.mp3")
}